# mehmetfatihdata

In [41]:
import pandas as pd
import numpy as np
import statistics
import warnings
warnings.filterwarnings('ignore')

## 1.SORU

In [42]:
data = pd.DataFrame()
data['nation'] = ['china'] * 1000 + ['europe'] * 1000
data['age'] = np.append(np.random.normal(30, 5, 1000), np.random.normal(25, 2, 1000))
data['wage'] = np.append(np.random.normal(1000, 50, 1000), np.random.normal(500, 100, 1000))
data['performance'] = np.append(np.random.normal(70, 10, 1000), np.random.normal(90, 5, 1000))
data

      nation        age         wage  performance
0      china  21.149210  1033.617709    73.101185
1      china  28.002113   935.402040    77.839892
2      china  22.616836   971.116628    72.584181
3      china  26.674379   992.688398    83.508794
4      china  24.441907   905.423321    85.177684
...      ...        ...          ...          ...
1995  europe  23.194023   519.965714    90.250081
1996  europe  25.281864   385.810382    85.387353
1997  europe  25.685939   571.302007    86.263673
1998  europe  24.278058   625.347066    86.820762
1999  europe  22.733399   499.897126    94.752191

[2000 rows x 4 columns]

In [46]:
print(sum(data['age']) / len(data['age']))
print(np.mean(data['age']))
print(data["age"].mean())
print(statistics.mean(data['age']))

27.54167566422614
27.54167566422614
27.54167566422614
27.541675664226116

In [55]:
print(np.median(data['age']))
print(data["age"].median())
print(statistics.median(data['age']))

26.50509571090733
26.50509571090733
26.50509571090733

In [57]:
print(np.var(data['age'], ddof=1))
print(data['age'].var())

20.788627941292155
20.788627941292155

In [72]:
print(data.age.std())
np.std(data['age'], ddof=1)

4.559454785529971

4.559454785529971

In [70]:
np.std(data['age'] ,ddof=1) / np.sqrt(len(data['age']))

0.1019525084078174

In [73]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 4 columns):
nation         2000 non-null object
age            2000 non-null float64
wage           2000 non-null float64
performance    2000 non-null float64
dtypes: float64(3), object(1)
memory usage: 62.6+ KB

In [22]:
data.describe()

               age         wage  performance
count  2000.000000  2000.000000  2000.000000
mean     27.402907   753.399253    79.754688
std       4.522005   261.825767    13.068468
min      14.582487   117.982241    39.260134
25%      24.278543   504.387340    69.226483
50%      26.412810   835.276032    83.309721
75%      29.737744  1002.188874    90.268724
max      43.962653  1154.597114   106.212270

data = pd.DataFrame()
data['nation'] = ['china'] * 100 + ['europe'] * 100 + ['arabia'] *100
data['age'] = np.append(np.random.normal(25, 10, 100), np.random.normal(20, 5, 100), np.random.normal(30, 10, 100))
data['wage'] = np.append(np.random.normal(25, 8, 100), np.random.normal(20, 5, 100), np.random.normal(30, 10, 100))
data['performance'] = np.append(np.random.normal(25, 8, 100), np.random.normal(20, 5, 100), np.random.normal(30, 10, 100))
data

BİTTİ.